<html>
<body>

    <h1 style="color: rgba(61, 14, 233, 0.333)">Definiciones</h1>   
    
    <h2 style="color:rgba(250, 0, 0, 0.333)" >Lenguaje de marcas</h2>
   
    <p>Un lenguaje de marcado o lenguaje de marcas es una forma de codificar un documento que, junto con el texto, incorpora etiquetas o marcas que contienen informaci&oacute;n adicional acerca de la estructura del texto o su presentaci&oacute;n.</p>

    <h2 style="color:rgba(250, 0, 0, 0.333)">Sistema de gesti&oacute;n de informaci&oacute;n</h2>

    <p>Los sistemas de informaci&oacute;n de gesti&oacute;n (MIS por sus siglas en ingl&eacute;s) son un tipo de sistemas de informaci&oacute;n que recopilan y procesan informaci&oacute;n de diferentes fuentes para ayudar en la toma de decisiones en lo referente a la gesti&oacute;n de la organizaci&oacute;n.</p>

    <h2 style="color: rgba(250, 0, 0, 0.333);">Sistema de gesti&oacute;n empresarial</h2>

    <p>Son los sistemas de informaci&oacute;n gerenciales que integran y manejan muchos de los negocios asociados con las operaciones de producci&oacute;n y de los aspectos de distribuci&oacute;n de una compa&ntilde;&iacute;a en la producci&oacute;n de bienes o servicios. Los sistemas ERP t&iacute;picamente manejan la producci&oacute;n, log&iacute;stica, distribuci&oacute;n, inventario, env&iacute;os, facturas y contabilidad de la compa&ntilde;&iacute;a de forma modular.Sin embargo, la planificaci&oacute;n de recursos empresariales o el software ERP puede intervenir en el control de muchas actividades de negocios como ventas, entregas, pagos, producci&oacute;n, administraci&oacute;n de inventarios, calidad de administraci&oacute;n y la administraci&oacute;n de recursos humanos.</p>

    <h1 style="color: rgba(61, 14, 233, 0.333)">Caracter&iacute;sticas</h1>  

    <h2 style="color:rgba(250, 0, 0, 0.333)" >HTML</h2>

    <p>La informaci&oacute;n repartida en p&aacute;ginas no muy grandes enlazadas entre s&iacute;.</p>

    <p>El Web  es hipertexto y  f&aacute;cil navegar por &eacute;l.</p>
    
    <p>Compatible con todo tipo de ordenadores (PCs, Macintosh, estaciones de trabajo...) y con todo tipo de sistemas operativos (Windows, MS-DOS, UNIX, MAC-OS,...).</p>
    
   <p>Din&aacute;mico: el proceso de cambiar y actualizar la informaci&oacute;n es &aacute;gil y r&aacute;pido.</p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >CSS</h2>

   <p>Complementariedad con documentos estructurados.</p>

   <p>Independencia del vendedor, la plataforma y el dispositivo.</p>

   <p>Mantenibilidad.</p>

   <p>Simplicidad.</p>

   <p>Rendimiento de la red.</p>
   
   <p>Flexibilidad.</p>

   <p>Riqueza.</p>

   <p>Combinaci&oacute;n con lenguajes alternativos.</p>

   <p>Accesibilidad.</p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >XHTML</h2>

   <p>Los documentos XHTML son conformes a XML. Como tales, son f&aacute;cilmente visualizados, editados y validados con herramientas XML est&aacute;ndar. </p>

   <p>Los documentos XHTML pueden escribirse para que funcionen igual o mejor que lo hac&iacute;an antes tanto en las aplicaciones de usuario conformes a HTML 4.0 como en los nuevas aplicaciones conformes a XHTML 1.0. </p>

   <p> Los documentos XHTML pueden usar aplicaciones (por ejemplo scripts y applets) que se basen ya sea en el Modelo del Objeto Documento de HTML o XML[DOM].</p>

   <p>A medida que la familia XHTML evolucione, los documentos conformes a XHTML 1.0 estar&aacute;n m&aacute;s preparados para interactuar dentro de y entre distintos entornos XHTML. </p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >XML</h2>

   <p>Permite la creaci&oacute;n de etiquetas propias y permite asignar atributos a las etiquetas.</p>

   <p>En un documento XML la estructura y el dise&ntilde;o est&aacute;n completamente separados.</p>

   <p>XML se almacena en formato texto (no binario) lo cual hace que los documentos sean directamente entendibles. Es decir, los documentos tienen una estructura entendible tanto por los ordenadores como por las personas.</p>

   <p>Cada documento incluye metadatos sobre s&iacute; mismo, lo cual facilita la tarea de los motores de b&uacute;squedas en la web, ya que devolver&aacute;n respuestas m&aacute;s adecuadas y precisas.</p>

   <p>Permite la exportabilidad a otros formatos de publicaci&oacute;n de datos (HTML, PDF, texto enriquecido RTF, entre otros).</p>

   <p>XML es un est&aacute;ndar abierto no sujeto a ning&uacute;n tipo de licencia.</p>

   <p>XML permite la internacionalizaci&oacute;n, es decir puede trabajar con cualquier conjunto de caracteres, entre ellos el juego de caracteres UNICODE (utf-8).</p>

   <p>XML utiliza reglas de generaci&oacute;n concretas y, por tanto, los documentos son f&aacute;cilmente procesables.</p>
   
   <p>XML permite compartir informaci&oacute;n entre sistemas o fuentes de datos heterog&eacute;neas, por ejemplo, p&aacute;ginas web, distintas bases de datos, entre otras.</p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >XPath</h2>

   <p>Es un lenguaje que permite construir expresiones que recorren y procesan un documento XML. La idea es parecida a las expresiones regulares para seleccionar partes de un texto sin atributos (plain text). XPath permite buscar y seleccionar teniendo en cuenta la estructura jer&aacute;rquica del XML. XPath fue creado para su uso en el est&aacute;ndar XSLT, en el que se usa para seleccionar y examinar la estructura del documento de entrada de la transformaci&oacute;n. XPath fue definido por el consorcio W3C.</p>

   <p>Todo el procesamiento realizado con un fichero XML est&aacute; basado en la posibilidad de direccionar o acceder a cada una de las partes que lo componen, de modo que podamos tratar cada uno de los elementos de forma diferenciada.</p>

   <p>El tratamiento del fichero XML comienza por la localizaci&oacute;n del mismo a lo largo del conjunto de documentos existentes en el mundo. Para llevar a cabo esta localizaci&oacute;n de forma un&iacute;voca, se utilizan los URI (Uniform Resource Identifiers), de los cuales los URL (Uniform Resource Locators) son sin duda los m&aacute;s conocidos.</p>

   <p>XPath en s&iacute; es un lenguaje sofisticado y complejo.</p>

   <p>XPath es a su vez la base sobre la que se han especificado nuevas herramientas que aprovechan para el tratamiento de documentos XML. Herramientas tales como XPointer, XLink y XQuery (el lenguaje que maneja los documentos XML como si de una base de datos se tratase). As&iacute;, XPath sirve para decir c&oacute;mo una hoja de estilo debe procesar el contenido de una p&aacute;gina XML, pero tambi&eacute;n para poder poner enlaces o cargar en un navegador zonas determinadas de una p&aacute;gina XML, en vez de toda la p&aacute;gina.</p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >XQuery</h2>

   <p>XQuery proporciona los medios para extraer y manipular informaci&oacute;n de documentos XML, o de cualquier fuente de datos que pueda ser representada mediante XML como, por ejemplo, bases de datos relacionales o documentos ofim&aacute;ticos.</p>

   <p>XQuery utiliza expresiones XPath para acceder a determinadas partes del documento XML. A&ntilde;ade, adem&aacute;s, expresiones similares a las usadas en SQL, conocidas como expresiones FLWOR. Las expresiones FLWOR toman su nombre de los 5 tipos de sentencias de las que pueden estar compuestas: FOR, LET, WHERE, ORDER BY y RETURN.</p>

   <p>Tambi&eacute;n incluye la posibilidad de construir nuevos documentos XML a partir de los resultados de la consulta. Se puede usar una sintaxis similar a XML si la estructura (elementos y atributos) es conocida con antelaci&oacute;n, o usar expresiones de construcci&oacute;n din&aacute;mica de nodos en caso contrario. Todos estos constructores se definen como expresiones dentro del lenguaje, y se pueden anidar arbitrariamente.</p>

   <p>El lenguaje se basa en el modelo en &aacute;rbol de la informaci&oacute;n contenida en el documento XML, que consiste en siete tipos distintos de nodo: elementos, atributos, nodos de texto, comentarios, instrucciones de procesamiento, espacios de nombres y nodos de documentos.</p>

   <p>El sistema de tipos usado por el lenguaje considera todos los valores como secuencias, asumi&eacute;ndose un valor simple como una secuencia de un solo elemento. Los elementos de una secuencia pueden ser valores at&oacute;micos o nodos. Los valores at&oacute;micos pueden ser n&uacute;meros enteros, cadenas de texto, valores booleanos, etc. La lista completa de los tipos disponibles est&aacute; basada en las primitivas definidas en XML Schema.</p>

   <p>XQuery 1.0 no incluye capacidad de actualizar los documentos XML. Tampoco puede realizar b&uacute;squedas textuales. Estas dos capacidades est&aacute;n siendo objeto de desarrollo para su posible incorporaci&oacute;n en la siguiente versi&oacute;n del lenguaje.</p>

   <h2 style="color:rgba(250, 0, 0, 0.333)" >Markdown</h2>

   <p>Markdown es un lenguaje de marcado ligero creado por John Gruber. El objetivo que busca este lenguaje es mejorar la facilidad de publicaci&oacute;n de contenido. Es decir, que escribas m&aacute;s r&aacute;pido y obtengas un resultado final mejor. Con simples comandos mientras est&aacute;s escribiendo puedes darle formato al texto final que obtendr&aacute;s.</p>


</body>
</html>